0.1.0/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  wall
  {
    type            epsilonWallFunction;
    value           uniform 0.01;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
