0.1.0/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/0/p_rgh
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p_rgh;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  wall
  {
    type            fixedFluxPressure;
    rho             rhok;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
