0.1.0/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;
vertices
(
  (-2.03 -2.0  0)
  ( 8.03 -2.0  0)
  ( 8.03  8.0  0)
  (-2.03  8.0  0)
  (-2.03 -2.0  5)
  ( 8.03 -2.0  5)
  ( 8.03  8.0  5)
  (-2.03  8.0  5)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 20 10) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  maxY
  {
    type symmetryPlane;
    faces
    (
      (3 7 6 2)
    );
  }
  minX
  {
    type symmetryPlane;
    faces
    (
      (0 4 7 3)
    );
  }
  maxX
  {
    type symmetryPlane;
    faces
    (
      (2 6 5 1)
    );
  }
  minY
  {
    type symmetryPlane;
    faces
    (
      (1 5 4 0)
    );
  }
  ground
  {
    type        wall;
    faces
    (
      (0 3 2 1)
    );
  }
  maxZ
  {
    type symmetryPlane;
    faces
    (
      (4 5 6 7)
    );
  }
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
