0.1.0/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p_rgh
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-08;
    relTol          0.01;
  }
  "(U|T|k|epsilon)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 2;
  pRefCell        0;
  pRefValue       0;
  residualControl
  {
    p_rgh           1e-2;
    U               1e-4;
    T               1e-3;
    // possibly check turbulence fields
    "(k|epsilon|omega)" 1e-3;
  }
}
relaxationFactors
{
  fields
  {
    p_rgh           0.7;
  }
  equations
  {
    U               0.2;
    T               0.5;
    "(k|epsilon)"   0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
